
# State **`s3://infrahouse-aws-control-303467602807/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |   🟡 Change |   🔴 Destroy |
|----------:|---------:|------------:|-------------:|
|        ✅ |        2 |           4 |            2 |
## Affected resources by action

|  Action  | Resources                                                            |
|:--------:|:---------------------------------------------------------------------|
|    🟡    | `module.github_backup_pem.aws_secretsmanager_secret.secret`          |
|    🟡    | `module.github_backup_pem.aws_secretsmanager_secret_version.current` |
|    🟡    | `module.github_backup_pem_ue1.aws_secretsmanager_secret.secret`      |
|    🟡    | `module.github_backup_pem_uw2.aws_secretsmanager_secret.secret`      |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.github_backup_pem.data.external.secret_value will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "secret_value" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/github_backup_pem/assets/get_secret.py",
          + "us-west-1",
          + "arn:aws:secretsmanager:us-west-1:303467602807:secret:github-backup-test-pem20260210214744093100000004-jKcjSM",
          + "arn:aws:iam::303467602807:role/ih-tf-aws-control-303467602807-admin",
        ]
      + result  = (known after apply)
    }

  # module.github_backup_pem.aws_secretsmanager_secret.secret will be updated in-place
  ~ resource "aws_secretsmanager_secret" "secret" {
        id                             = "arn:aws:secretsmanager:us-west-1:303467602807:secret:github-backup-test-pem20260210214744093100000004-jKcjSM"
        name                           = "github-backup-test-pem20260210214744093100000004"
      ~ policy                         = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action    = "*"
                        Condition = {
                            ArnLike = {
                                "aws:PrincipalArn" = "arn:aws:iam::303467602807:role/ih-tf-aws-control-303467602807-admin"
                            }
                        }
                        Effect    = "Allow"
                        Principal = {
                            AWS = "*"
                        }
                        Resource  = "*"
                    },
                  ~ {
                      ~ Condition = {
                          ~ ArnLike = {
                              ~ "aws:PrincipalArn" = "arn:aws:iam::990466748045:user/aleks" -> "arn:aws:iam::303467602807:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_422821c726d81c14"
                            }
                        }
                        # (4 unchanged attributes hidden)
                    },
                  ~ {
                      ~ Condition = {
                          ~ ArnLike = {
                              ~ "aws:PrincipalArn" = "arn:aws:iam::990466748045:user/aleks" -> "arn:aws:iam::303467602807:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_422821c726d81c14"
                            }
                        }
                        # (4 unchanged attributes hidden)
                    },
                    {
                        Action    = [
                            "secretsmanager:ListSecretVersionIds",
                            "secretsmanager:GetSecretValue",
                            "secretsmanager:GetResourcePolicy",
                            "secretsmanager:GetRandomPassword",
                            "secretsmanager:DescribeSecret",
                        ]
                        Condition = {
                            ArnLike = {
                                "aws:PrincipalArn" = "arn:aws:iam::303467602807:role/github-backup-tester"
                            }
                        }
                        Effect    = "Allow"
                        Principal = {
                            AWS = "*"
                        }
                        Resource  = "*"
                    },
                    # (2 unchanged elements hidden)
                    {
                        Action    = [
                            "secretsmanager:ValidateResourcePolicy",
                            "secretsmanager:UpdateSecretVersionStage",
                            "secretsmanager:UpdateSecret",
                            "secretsmanager:UntagResource",
                            "secretsmanager:TagResource",
                            "secretsmanager:StopReplicationToReplica",
                            "secretsmanager:RotateSecret",
                            "secretsmanager:RestoreSecret",
                            "secretsmanager:ReplicateSecretToRegions",
                            "secretsmanager:RemoveRegionsFromReplication",
                            "secretsmanager:PutSecretValue",
                            "secretsmanager:PutResourcePolicy",
                            "secretsmanager:ListSecretVersionIds",
                            "secretsmanager:GetSecretValue",
                            "secretsmanager:GetRandomPassword",
                            "secretsmanager:DeleteSecret",
                            "secretsmanager:DeleteResourcePolicy",
                            "secretsmanager:CreateSecret",
                            "secretsmanager:CancelRotateSecret",
                            "secretsmanager:BatchGetSecretValue",
                        ]
                        Effect    = "Deny"
                        Principal = {
                            AWS = "arn:aws:iam::303467602807:role/aws-service-role/access-analyzer.amazonaws.com/AWSServiceRoleForAccessAnalyzer"
                        }
                        Resource  = "*"
                    },
                  ~ {
                      ~ Condition = {
                          ~ ArnNotLike = {
                              ~ "aws:PrincipalArn" = [
                                    # (1 unchanged element hidden)
                                    "arn:aws:iam::303467602807:role/aws-service-role/access-analyzer.amazonaws.com/AWSServiceRoleForAccessAnalyzer",
                                  ~ "arn:aws:iam::990466748045:user/aleks" -> "arn:aws:iam::303467602807:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_422821c726d81c14",
                                    "arn:aws:iam::303467602807:role/github-backup-tester",
                                ]
                            }
                        }
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags                           = {
            "account"           = "303467602807"
            "created_by_module" = "infrahouse/secret/aws"
            "environment"       = "development"
            "module_version"    = "1.1.1"
            "owner"             = "arn:aws:iam::303467602807:role/ih-tf-aws-control-303467602807-admin"
            "service"           = "github-backup-test"
        }
        # (7 unchanged attributes hidden)
    }

  # module.github_backup_pem.aws_secretsmanager_secret_version.current will be updated in-place
  ~ resource "aws_secretsmanager_secret_version" "current" {
        id               = "arn:aws:secretsmanager:us-west-1:303467602807:secret:github-backup-test-pem20260210214744093100000004-jKcjSM|terraform-20260210214744845300000008"
      ~ version_stages   = [
          - "AWSCURRENT",
            # (1 unchanged element hidden)
        ]
        # (6 unchanged attributes hidden)
    }

  # module.github_backup_pem_ue1.data.external.secret_value will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "secret_value" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/github_backup_pem_ue1/assets/get_secret.py",
          + "us-east-1",
          + "arn:aws:secretsmanager:us-east-1:303467602807:secret:github-backup-test-pem20260210214744117400000001-o1kSho",
          + "arn:aws:iam::303467602807:role/ih-tf-aws-control-303467602807-admin",
        ]
      + result  = (known after apply)
    }

  # module.github_backup_pem_ue1.aws_secretsmanager_secret.secret will be updated in-place
  ~ resource "aws_secretsmanager_secret" "secret" {
        id                             = "arn:aws:secretsmanager:us-east-1:303467602807:secret:github-backup-test-pem20260210214744117400000001-o1kSho"
        name                           = "github-backup-test-pem20260210214744117400000001"
      ~ policy                         = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action    = "*"
                        Condition = {
                            ArnLike = {
                                "aws:PrincipalArn" = "arn:aws:iam::303467602807:role/ih-tf-aws-control-303467602807-admin"
                            }
                        }
                        Effect    = "Allow"
                        Principal = {
                            AWS = "*"
                        }
                        Resource  = "*"
                    },
                  ~ {
                      ~ Condition = {
                          ~ ArnLike = {
                              ~ "aws:PrincipalArn" = "arn:aws:iam::990466748045:user/aleks" -> "arn:aws:iam::303467602807:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_422821c726d81c14"
                            }
                        }
                        # (4 unchanged attributes hidden)
                    },
                  ~ {
                      ~ Condition = {
                          ~ ArnLike = {
                              ~ "aws:PrincipalArn" = "arn:aws:iam::990466748045:user/aleks" -> "arn:aws:iam::303467602807:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_422821c726d81c14"
                            }
                        }
                        # (4 unchanged attributes hidden)
                    },
                    {
                        Action    = [
                            "secretsmanager:ListSecretVersionIds",
                            "secretsmanager:GetSecretValue",
                            "secretsmanager:GetResourcePolicy",
                            "secretsmanager:GetRandomPassword",
                            "secretsmanager:DescribeSecret",
                        ]
                        Condition = {
                            ArnLike = {
                                "aws:PrincipalArn" = "arn:aws:iam::303467602807:role/github-backup-tester"
                            }
                        }
                        Effect    = "Allow"
                        Principal = {
                            AWS = "*"
                        }
                        Resource  = "*"
                    },
                    # (2 unchanged elements hidden)
                    {
                        Action    = [
                            "secretsmanager:ValidateResourcePolicy",
                            "secretsmanager:UpdateSecretVersionStage",
                            "secretsmanager:UpdateSecret",
                            "secretsmanager:UntagResource",
                            "secretsmanager:TagResource",
                            "secretsmanager:StopReplicationToReplica",
                            "secretsmanager:RotateSecret",
                            "secretsmanager:RestoreSecret",
                            "secretsmanager:ReplicateSecretToRegions",
                            "secretsmanager:RemoveRegionsFromReplication",
                            "secretsmanager:PutSecretValue",
                            "secretsmanager:PutResourcePolicy",
                            "secretsmanager:ListSecretVersionIds",
                            "secretsmanager:GetSecretValue",
                            "secretsmanager:GetRandomPassword",
                            "secretsmanager:DeleteSecret",
                            "secretsmanager:DeleteResourcePolicy",
                            "secretsmanager:CreateSecret",
                            "secretsmanager:CancelRotateSecret",
                            "secretsmanager:BatchGetSecretValue",
                        ]
                        Effect    = "Deny"
                        Principal = {
                            AWS = "arn:aws:iam::303467602807:role/aws-service-role/access-analyzer.amazonaws.com/AWSServiceRoleForAccessAnalyzer"
                        }
                        Resource  = "*"
                    },
                  ~ {
                      ~ Condition = {
                          ~ ArnNotLike = {
                              ~ "aws:PrincipalArn" = [
                                    # (1 unchanged element hidden)
                                    "arn:aws:iam::303467602807:role/aws-service-role/access-analyzer.amazonaws.com/AWSServiceRoleForAccessAnalyzer",
                                  ~ "arn:aws:iam::990466748045:user/aleks" -> "arn:aws:iam::303467602807:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_422821c726d81c14",
                                    "arn:aws:iam::303467602807:role/github-backup-tester",
                                ]
                            }
                        }
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags                           = {
            "account"           = "303467602807"
            "created_by_module" = "infrahouse/secret/aws"
            "environment"       = "development"
            "module_version"    = "1.1.1"
            "owner"             = "arn:aws:iam::303467602807:role/ih-tf-aws-control-303467602807-admin"
            "service"           = "github-backup-test"
        }
        # (7 unchanged attributes hidden)
    }

  # module.github_backup_pem_ue1.aws_secretsmanager_secret_version.current must be replaced
-/+ resource "aws_secretsmanager_secret_version" "current" {
      ~ arn                  = "arn:aws:secretsmanager:us-east-1:303467602807:secret:github-backup-test-pem20260210214744117400000001-o1kSho" -> (known after apply)
      + has_secret_string_wo = (known after apply)
      ~ id                   = "arn:aws:secretsmanager:us-east-1:303467602807:secret:github-backup-test-pem20260210214744117400000001-o1kSho|terraform-20260210214746143900000003" -> (known after apply)
      ~ secret_string        = (sensitive value) # forces replacement
      ~ version_id           = "terraform-20260210214746143900000003" -> (known after apply)
      ~ version_stages       = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.github_backup_pem_uw2.data.external.secret_value will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "secret_value" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/github_backup_pem_uw2/assets/get_secret.py",
          + "us-west-2",
          + "arn:aws:secretsmanager:us-west-2:303467602807:secret:github-backup-test-pem20260210214744107600000001-4HbNtK",
          + "arn:aws:iam::303467602807:role/ih-tf-aws-control-303467602807-admin",
        ]
      + result  = (known after apply)
    }

  # module.github_backup_pem_uw2.aws_secretsmanager_secret.secret will be updated in-place
  ~ resource "aws_secretsmanager_secret" "secret" {
        id                             = "arn:aws:secretsmanager:us-west-2:303467602807:secret:github-backup-test-pem20260210214744107600000001-4HbNtK"
        name                           = "github-backup-test-pem20260210214744107600000001"
      ~ policy                         = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action    = "*"
                        Condition = {
                            ArnLike = {
                                "aws:PrincipalArn" = "arn:aws:iam::303467602807:role/ih-tf-aws-control-303467602807-admin"
                            }
                        }
                        Effect    = "Allow"
                        Principal = {
                            AWS = "*"
                        }
                        Resource  = "*"
                    },
                  ~ {
                      ~ Condition = {
                          ~ ArnLike = {
                              ~ "aws:PrincipalArn" = "arn:aws:iam::990466748045:user/aleks" -> "arn:aws:iam::303467602807:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_422821c726d81c14"
                            }
                        }
                        # (4 unchanged attributes hidden)
                    },
                  ~ {
                      ~ Condition = {
                          ~ ArnLike = {
                              ~ "aws:PrincipalArn" = "arn:aws:iam::990466748045:user/aleks" -> "arn:aws:iam::303467602807:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_422821c726d81c14"
                            }
                        }
                        # (4 unchanged attributes hidden)
                    },
                    {
                        Action    = [
                            "secretsmanager:ListSecretVersionIds",
                            "secretsmanager:GetSecretValue",
                            "secretsmanager:GetResourcePolicy",
                            "secretsmanager:GetRandomPassword",
                            "secretsmanager:DescribeSecret",
                        ]
                        Condition = {
                            ArnLike = {
                                "aws:PrincipalArn" = "arn:aws:iam::303467602807:role/github-backup-tester"
                            }
                        }
                        Effect    = "Allow"
                        Principal = {
                            AWS = "*"
                        }
                        Resource  = "*"
                    },
                    # (2 unchanged elements hidden)
                    {
                        Action    = [
                            "secretsmanager:ValidateResourcePolicy",
                            "secretsmanager:UpdateSecretVersionStage",
                            "secretsmanager:UpdateSecret",
                            "secretsmanager:UntagResource",
                            "secretsmanager:TagResource",
                            "secretsmanager:StopReplicationToReplica",
                            "secretsmanager:RotateSecret",
                            "secretsmanager:RestoreSecret",
                            "secretsmanager:ReplicateSecretToRegions",
                            "secretsmanager:RemoveRegionsFromReplication",
                            "secretsmanager:PutSecretValue",
                            "secretsmanager:PutResourcePolicy",
                            "secretsmanager:ListSecretVersionIds",
                            "secretsmanager:GetSecretValue",
                            "secretsmanager:GetRandomPassword",
                            "secretsmanager:DeleteSecret",
                            "secretsmanager:DeleteResourcePolicy",
                            "secretsmanager:CreateSecret",
                            "secretsmanager:CancelRotateSecret",
                            "secretsmanager:BatchGetSecretValue",
                        ]
                        Effect    = "Deny"
                        Principal = {
                            AWS = "arn:aws:iam::303467602807:role/aws-service-role/access-analyzer.amazonaws.com/AWSServiceRoleForAccessAnalyzer"
                        }
                        Resource  = "*"
                    },
                  ~ {
                      ~ Condition = {
                          ~ ArnNotLike = {
                              ~ "aws:PrincipalArn" = [
                                    # (1 unchanged element hidden)
                                    "arn:aws:iam::303467602807:role/aws-service-role/access-analyzer.amazonaws.com/AWSServiceRoleForAccessAnalyzer",
                                  ~ "arn:aws:iam::990466748045:user/aleks" -> "arn:aws:iam::303467602807:role/aws-reserved/sso.amazonaws.com/us-west-1/AWSReservedSSO_AWSAdministratorAccess_422821c726d81c14",
                                    "arn:aws:iam::303467602807:role/github-backup-tester",
                                ]
                            }
                        }
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags                           = {
            "account"           = "303467602807"
            "created_by_module" = "infrahouse/secret/aws"
            "environment"       = "development"
            "module_version"    = "1.1.1"
            "owner"             = "arn:aws:iam::303467602807:role/ih-tf-aws-control-303467602807-admin"
            "service"           = "github-backup-test"
        }
        # (7 unchanged attributes hidden)
    }

  # module.github_backup_pem_uw2.aws_secretsmanager_secret_version.current must be replaced
-/+ resource "aws_secretsmanager_secret_version" "current" {
      ~ arn                  = "arn:aws:secretsmanager:us-west-2:303467602807:secret:github-backup-test-pem20260210214744107600000001-4HbNtK" -> (known after apply)
      + has_secret_string_wo = (known after apply)
      ~ id                   = "arn:aws:secretsmanager:us-west-2:303467602807:secret:github-backup-test-pem20260210214744107600000001-4HbNtK|terraform-20260210214746143900000003" -> (known after apply)
      ~ secret_string        = (sensitive value) # forces replacement
      ~ version_id           = "terraform-20260210214746143900000003" -> (known after apply)
      ~ version_stages       = (sensitive value)
        # (3 unchanged attributes hidden)
    }

Plan: 2 to add, 4 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDIsICJjaGFuZ2UiOiA0LCAiZGVzdHJveSI6IDJ9fQ==
```
</details>